const max = Math.max(12, 85, 99, 78);
// const largest = Math.max;
const numbers = [12, 85, 99, 78];
const largest = Math.max(...numbers);
console.log(...numbers);
console.log(largest);

//একটি ্এ্যারেকে যখন আরেকটা ভেরিয়াবেল দিয়ে ডিক্লেয়ার করা হয়, তখন সেই ভেরিয়াবেল টা আগের ভেরিয়াবেলের সেইম এ্যারেকে রিফার করে বা আগের টাকে ধরে রাখে।
// সেজন্য এবটি এ্যরে থেকে আরেকটা েএ্যারেকে যখন রেখার করতে হয় তখন সেটার আগে ...array করে আগের এ্যারের উপাদানগুলো বসিয়ে দেওয়া যায়। সাথে সাথে যদি আরো উপাদান ঢুকানোর প্রয়োজন হলে সেটার আগে বা পরে উপদানগুলো , , দিয়ে লেখে নতুন ভেরিয়োবেলে রাখলেই ্এ্যারেটা কপি হয়ে যাবে সাথে নতুন উপদানাগুলোও যোগ করা হয়ে যাবে।

const numbers3 = [...numbers];
const numbers4 = [44, 45, 46, 47, ...numbers, 48, 49];
